


get_data_conf = {
                'snippets': ( "OpenLandMap/SOL/SOL_SAND-WFRACTION_USDA-3A1A1A_M/v02",
                            "OpenLandMap/SOL/SOL_CLAY-WFRACTION_USDA-3A1A1A_M/v02",
                            "OpenLandMap/SOL/SOL_ORGANIC-CARBON_USDA-6A1C_M/v02", 
                            "NRCan/CDEM",
                            "OpenLandMap/CLM/CLM_LST_MOD11A2-DAYNIGHT_M/v01"
                            ),
                'scale_factors': (1 * 0.01,
                                 1 * 0.01, 
                                 5 * 0.001, 
                                 1, 
                                 0.02
                                 ),
                'incorrect': {
                    'param': ("s", 3, (1,2,3), {'e':1}, None),
                    'lat1': ('21','0.0000000000001','-1902','11','24'),
                    'long1': ('91.02','0.000022','0','221232','1'),

                     #Долгота и широта точек внутри Канады на воде
                    'lat2': (53.396671,
                            57.517234,
                            59.439793,
                            65.715538,
                            49.556030,
                            55.466201
                             ),
                    'long2': (-98.643733,
                             -106.428170,
                             -109.525231,
                             -121.554487,
                             -124.597845, 
                             -115.126708
                            )
                },
                'correct': {
                    'param':("sand", "clay", "orgc", "elev", "diurnal"),
                    #Долгота и широта точек внутри Канады на суше 
                    'lat1': (61.128185,
                            56.330494,
                            57.182190,
                            56.053858,
                            55.670218,
                            58.924449
                            ),
                    'long1': (-129.597130,
                             -110.641980,
                             -117.913300,
                             -105.110804,
                              -90.630312, 
                              -131.859652
                            ),
                    
                    # Долгота и широта точек у границ Канады (1-10км)
                    'lat2': (49.019995,
                            49.031839,
                            49.037972,
                            62.608366,
                            67.050963,
                            69.590356,
                            65.957837,
                            61.523529,
                            56.937915,
                            52.173362,
                            57.631715,
                            56.068445
                            ),
                    'long2': (-121.003641,
                              -120.421385,
                              -119.857220,
                              -140.840118,
                              -140.833258, 
                              -129.382363,
                              -115.700160,
                              -108.700705,
                              -90.673452,
                              -82.153954,
                              -76.260329,
                              -61.963912
                             )
                    }
}